# CreateImageControl

## Description
Creates a Layout Manager image control.

```pascal
PROCEDURE CreateImageControl(
				dialogID      : LONGINT;
				componentID   : LONGINT;
				iWidthPixels  : INTEGER;
				iHeightPixels : INTEGER;
				hImage        : HANDLE);
```

```python

def vs.CreateImageControl(dialogID, componentID, iWidthPixels, iHeightPixels, hImage):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|dialogID|LONGINT||
|componentID|LONGINT||
|iWidthPixels|INTEGER||
|iHeightPixels|INTEGER||
|hImage|HANDLE||

## Version
Availability: from VectorWorks12.0
## Category
* Dialogs - Modern